# 01. Improting Libraries

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
# Creating path

path = r'/Users/david/Desktop/CF/Data Immersion/Achievement 4 - Python Fundamentals for Data Analysts/07-2022 Instacart Basket Analysis'

In [3]:
# verifying 'path' variable

path

'/Users/david/Desktop/CF/Data Immersion/Achievement 4 - Python Fundamentals for Data Analysts/07-2022 Instacart Basket Analysis'

# 02. Importing Dataframes

In [5]:
# Improting 'products.csv' as 'df_prods' from 'Original Data' folder

df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', '4', 'products.csv'), index_col = False)

In [6]:
# Verifying 'df_prods'

df_prods

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [11]:
# Importing 'orderds_wrangled_2.csv' as 'df_ords' from 'Prepared Data' folder

df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled_2.csv'), index_col = False)

In [12]:
# verifying 'df_ords'

df_ords

,Unnamed: 0,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,29.0
3421079,3421079,1854736,206209,11,4,10,30.0
3421080,3421080,626363,206209,12,1,12,18.0
3421081,3421081,2977660,206209,13,1,12,7.0
3421082,3421082,272231,206209,14,6,14,30.0

In [13]:
# Dropping second index 'Unnamed: 0'
df_ords.drop(columns = ['Unnamed: 0'])

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [14]:
df_ords = df_ords.drop(columns = ['Unnamed: 0'])

In [15]:
df_ords

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [16]:
# Describing 'df_ords'

df_ords.describe()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

# 03. Data Consistency Checks

## 03.1 Mixed-Type Data

In [17]:
# Create a dataframe--learning to deal with Mixed-Type Data

df_test = pd.DataFrame()
# This code creates a new dataframe

In [18]:

df_test

Empty DataFrame
Columns: []
Index: []

In [19]:
df_test['mix'] = ['a', 'b', 1, True]
# This code creates a column named 'mix' with the assigned values within 'df_test'

In [20]:
df_test

    mix
0     a
1     b
2     1
3  True

In [21]:
# Create custom function to search in the dataframe for mixed-type columns (given by CF)
# Check for mixed types custom fucntion:

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)
    
    
# The structure used in this code is called a 'for-loop':
# 'for' stands for 'for these elements do this'
# The loop describes how the structure works: looping over and over again as it performs the procedures detailed by the “for.”
# Whithin the 'for-loop', the 'weird' variable is created. Assigned to it is a test that checks whether the data types within the column are consistent
# If True (1), that means the column contains inconsistent data types. If False (0), that means the column contains only one data type.
# the if statement is checking whether weird is true or false
#If it’s greater than 0, than it’s true. If not, it’s false. If weird is true, the command print(col) is executed, which prints the problematic column for you to see

mix

In [22]:
# Fixing the 'mix' column. Trnansforming column's values into strings

df_test['mix'] = df_test['mix'].astype('str')

# If we wantes numbers instead of string, we can substitute 'str' by 'int64' within '.astype'

In [24]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mix     4 non-null      object
dtypes: object(1)
memory usage: 160.0+ bytes

In [28]:
df_test.dtypes

mix    object
dtype: object

## 03.2 Missing Values

In [29]:
# Finding missing values with the following code

df_prods.isnull().sum()

# '.isnull' fucntion is to find missing observations. 
# The function by itself attached to the dataframe will only return a value of True or False, which is why we need to add '.sum()' 
# '.sum' attached to dataframe and '.isnull' function will sum a return all the missing values per column

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [31]:
# To visualize those 16 missing values in 'product_name' column, a subset can be created.
# Create new data frame as 'df_nan'containing the values in 'product_name' that meer the condition isnull() = True

df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [32]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

### 03.2.1 Addressing missing data

In [33]:
# There are a few ways to deal with missing data:

# 1.- Create a new variable that acts like a flag based on the missing value.
# 2.- Impute the value with the mean or median of the column (if the variable is numeric).
# 3.- Remove or filter out the missing data.

In [34]:
# 1.- Creating a new variable that acts like. flag based on the missing value
# If the missing values are as important as the non-missing values, then a new variable/column can be created to represent those missing values against the non-missing values

In [36]:
# 2.- Imputing values 
# If we are to input the values, we should choose either the mean or the median, whatever fits best;

# Mean, if there are not many outliers affecting the mean; the syntax is as follows:
# df['column with missings'].fillna(mean value, inplace=True)

# Median if there are many outliers to consider
# df['column with missings'].fillna(median value, inplace=True)

# Linear interpolation method:
#An alternative way to impute missing values is to use linear interpolation, which is a special way of dealing with missing data in time-series data. 
# Linear interpolation is a fancy way to say “connecting two points with a line,” and it involves finding the mean of the rows before the missing value occurs, 
# finding the mean of the rows after the missing value occurs, and estimating where the missing value should fall between those two means.

In [39]:
# In the case of missing 'string' values like in the 'df_nan' output,  
# can either remove the missing values entirely or filter out the ones that aren’t missing into a subset dataframe and continue your analysis with this new dataframe.
# run the 'df_prods.shape' function so you can compare the number of rows in your current dataframe with the number in your subset once the missing rows have been removed

df_prods.shape

(49693, 5)

In [45]:
# Create a new dataframe called 'df_prods_clean'. Can use the same line of code from above ('df_nan' dataframe)

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

# This dataframe will not include the null observations in 'product_name'

In [46]:
# Verifying new dataframe

df_prods_clean.shape

(49677, 5)

In [47]:
# Original dataframe's observations minus Subset's observations

49693 - 49677

16

In [48]:
# Another way you can drop all missing values is via the following command:

# df_prods.dropna(inplace = True)

In [49]:
# If you wanted to use this command to drop only the NaNs from a particular column, the code would look like this:

# df_prods.dropna(subset = [‘product_name’], inplace = True)

# In both cases, rather than creating an entirely new dataframe, you’re overwriting 'df_prods' with a new version of 'df_prods' that doesn’t contain the missing values
# 'inplace = True' function, which overwrites the original dataframe
# If 'inplace' argument is not especified, the function will take the default setting, which is 'inplace = False'.
# When specified as False, the command will only return a view of the changed dataframe, leaving the original dataframe untouched.

#As mentioned before, overwriting can be risky. Unless you’re absolutely sure it’s safe to drop the values in question, you should create a new dataframe instead.

## 03.3 Duplicates

In [50]:
# Be sure of identifying the duplicate values, and know why they might be duplicated
# Is it the whole ( full) observation, or just a piece (like the key, or another variable/column)?
# Most likely, the ones that will be consider duplicates will be FULL DUPLICATES, like in these dataframes

### 03.3.1 Finding Duplicates

In [51]:
# The following command will look for full duplicates within your dataframe:

df_dups = df_prods_clean[df_prods_clean.duplicated()]

# 'df_dups' is a subset of 'df_prods_clean' dataframe; the '.duplicated' function is what identifies the full duplicate observations
# Any duplciates will be part of this subset

In [52]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

### 03.3.2 Addressing Duplicates

In [53]:
# 'df.drop_duplciates' to delete duplicates from dataframe (always be sure on if it's convenient to do so)
# first chech the shape of:

df_prods_clean.shape

(49677, 5)

In [54]:
# Then, create a dataframe that does not contain the duplicates (as a subset):

df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [56]:
# Verifying the clean and without duplciates dataframe:

df_prods_clean_no_dups.shape

(49672, 5)

In [57]:
49677 - 49672

# New dataframe dropped 5 dups

5

# 04. Tyding Up and Exporting Changes

In [58]:
# Exporting 'df_prods_clean_no_dups' into 'Prepared Data' folder as 'products_checked.csv'
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'))